src/Documents/Приход/Приход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приход</name>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Приход/ManagerModule.bsl
#Область Интерфейс_МодульМодели
Процедура Модель_ПриУстановкеСвойств(КонтекстИзменений, ИменаСвойств) Экспорт
	глМодель_УстановитьСвойство(КонтекстИзменений, "КоэффициентПересчетаСуммаРегл", 65);
КонецПроцедуры

Процедура Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, ДанныеСтроки, Свойства) Экспорт
	Если ДанныеСтроки = Неопределено Тогда
		Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, "Товары", Свойства);
		Возврат;
		
	ИначеЕсли ДанныеСтроки = "Товары" Тогда
		Для Каждого СтрокаТаблицы Из глМодель_Данные(КонтекстИзменений)[ДанныеСтроки] Цикл
			Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, СтрокаТаблицы, Свойства)
		КонецЦикла;
		Возврат
	КонецЕсли;
	
	глМодель_УстановитьСвойствоСтроки(КонтекстИзменений, ДанныеСтроки, "ТипНоменклатуры", ДанныеСтроки.Номенклатура.Тип);
КонецПроцедуры
#КонецОбласти

Процедура ОбновитьИтоги(КонтекстИзменений, Параметры) Экспорт
	глМодель_ИзменитьРеквизит(КонтекстИзменений, "Сумма", глМодель_Данные(КонтекстИзменений).Товары.Итог("Сумма"));	
КонецПроцедуры
